Ran Plan for project: `dev` dir: `env/dev` workspace: `default`

<details><summary>Show Output</summary>

```diff
module.vpc.data.aws_availability_zones.available: Reading...
module.kms.data.aws_caller_identity.current: Reading...
module.kms.data.aws_caller_identity.current: Read complete after 0s [id=637423494924]
module.vpc.data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
 <= read (data resources)

Terraform will perform the following actions:

  # module.bastion.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
    }

  # module.bastion.aws_instance.bastion_host will be created
+ resource "aws_instance" "bastion_host" {
      + ami                                  = "ami-05576a079321f21f8"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = true
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "devopslite_dev_ssm_instance_profile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.medium"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Environment" = "dev"
          + "Name"        = "devopslite-dev-bastion-host"
          + "Project"     = "devopslite"
          + "Provisioner" = "terraform"
        }
      + tags_all                             = {
          + "Environment" = "dev"
          + "Name"        = "devopslite-dev-bastion-host"
          + "Project"     = "devopslite"
          + "Provisioner" = "terraform"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # module.bastion.aws_security_group.bastion_sg will be created
+ resource "aws_security_group" "bastion_sg" {
      + arn                    = (known after apply)
      + description            = "Security group for bastion host"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all traffic to all destinations"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "172.16.0.0/16",
                ]
              + description      = "Allow SSH from VPC CIDR"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "devopslite-dev-bastion-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "dev"
          + "Name"        = "devopslite-dev-bastion-sg"
          + "Project"     = "devopslite"
          + "Provisioner" = "terraform"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "Name"        = "devopslite-dev-bastion-sg"
          + "Project"     = "devopslite"
          + "Provisioner" = "terraform"
        }
      + vpc_id                 = (known after apply)
    }

  # module.ecr_be.aws_ecr_lifecycle_policy.policy_tagged will be created
+ resource "aws_ecr_lifecycle_policy" "policy_tagged" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 7 images"
                      + rulePriority = 2
                      + selection    = {
                          + countNumber   = 7
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "v",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "devopslite-be"
    }

  # module.ecr_be.aws_ecr_lifecycle_policy.policy_untagged will be created
+ resource "aws_ecr_lifecycle_policy" "policy_untagged" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Expire images older than 7 days"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 7
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "devopslite-be"
    }

  # module.ecr_be.aws_ecr_repository.repository will be created
+ resource "aws_ecr_repository" "repository" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "devopslite-be"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Environment" = "dev"
          + "Name"        = "devopslite-dev-devopslite-be"
          + "Project"     = "devopslite"
          + "Provisioner" = "terraform"
        }
      + tags_all             = {
          + "Environment" = "dev"
          + "Name"        = "devopslite-dev-devopslite-be"
          + "Project"     = "devopslite"
          + "Provisioner" = "terraform"
        }

      + encryption_configuration {
          + encryption_type = "KMS"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.ecr_fe.aws_ecr_lifecycle_policy.policy_tagged will be created
+ resource "aws_ecr_lifecycle_policy" "policy_tagged" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 7 images"
                      + rulePriority = 2
                      + selection    = {
                          + countNumber   = 7
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "v",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "devopslite-fe"
    }

  # module.ecr_fe.aws_ecr_lifecycle_policy.policy_untagged will be created
+ resource "aws_ecr_lifecycle_policy" "policy_untagged" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Expire images older than 7 days"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 7
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "devopslite-fe"
    }

  # module.ecr_fe.aws_ecr_repository.repository will be created
+ resource "aws_ecr_repository" "repository" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "devopslite-fe"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Environment" = "dev"
          + "Name"        = "devopslite-dev-devopslite-fe"
          + "Project"     = "devopslite"
          + "Provisioner" = "terraform"
        }
      + tags_all             = {
          + "Environment" = "dev"
          + "Name"        = "devopslite-dev-devopslite-fe"
          + "Project"     = "devopslite"
          + "Provisioner" = "terraform"
        }

      + encryption_configuration {
          + encryption_type = "KMS"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.eks.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.eks.data.aws_iam_policy.AmazonEC2ContainerRegistryPullOnly will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy" "AmazonEC2ContainerRegistryPullOnly" {
      + arn              = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryPullOnly"
      + attachment_count = (known after apply)
      + description      = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + path             = (known after apply)
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = (known after apply)
    }

  # module.eks.data.aws_iam_policy.AmazonEKSBlockStoragePolicy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy" "AmazonEKSBlockStoragePolicy" {
      + arn              = "arn:aws:iam::aws:policy/AmazonEKSBlockStoragePolicy"
      + attachment_count = (known after apply)
      + description      = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + path             = (known after apply)
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = (known after apply)
    }

  # module.eks.data.aws_iam_policy.AmazonEKSClusterPolicy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy" "AmazonEKSClusterPolicy" {
      + arn              = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + attachment_count = (known after apply)
      + description      = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + path             = (known after apply)
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = (known after apply)
    }

  # module.eks.data.aws_iam_policy.AmazonEKSComputePolicy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy" "AmazonEKSComputePolicy" {
      + arn              = "arn:aws:iam::aws:policy/AmazonEKSComputePolicy"
      + attachment_count = (known after apply)
      + description      = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + path             = (known after apply)
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = (known after apply)
    }

  # module.eks.data.aws_iam_policy.AmazonEKSLoadBalancingPolicy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy" "AmazonEKSLoadBalancingPolicy" {
      + arn              = "arn:aws:iam::aws:policy/AmazonEKSLoadBalancingPolicy"
      + attachment_count = (known after apply)
      + description      = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + path             = (known after apply)
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = (known after apply)
    }

  # module.eks.data.aws_iam_policy.AmazonEKSNetworkingPolicy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy" "AmazonEKSNetworkingPolicy" {
      + arn              = "arn:aws:iam::aws:policy/AmazonEKSNetworkingPolicy"
      + attachment_count = (known after apply)
      + description      = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + path             = (known after apply)
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = (known after apply)
    }

  # module.eks.data.aws_iam_policy.AmazonEKSWorkerNodePolicy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy" "AmazonEKSWorkerNodePolicy" {
      + arn              = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + attachment_count = (known after apply)
      + description      = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + path             = (known after apply)
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = (known after apply)
    }

  # module.eks.data.aws_iam_policy.AmazonEKS_CNI_Policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy" "AmazonEKS_CNI_Policy" {
      + arn              = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + attachment_count = (known after apply)
      + description      = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + path             = (known after apply)
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = (known after apply)
    }

  # module.eks.data.aws_iam_policy.AmazonSSMManagedInstanceCore will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy" "AmazonSSMManagedInstanceCore" {
      + arn              = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + attachment_count = (known after apply)
      + description      = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + path             = (known after apply)
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = (known after apply)
    }

  # module.eks.data.aws_iam_policy_document.eks_cluster_sa_assume_role_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "eks_cluster_sa_assume_role_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:kube-system:aws-node",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.eks.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
    }

  # module.eks.data.tls_certificate.eks_cluster_sa_tls will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "eks_cluster_sa_tls" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.eks.aws_eks_addon.addon_coredns will be created
+ resource "aws_eks_addon" "addon_coredns" {
      + addon_name           = "coredns"
      + addon_version        = "v1.11.4-eksbuild.2"
      + arn                  = (known after apply)
      + cluster_name         = "devopslite-dev-eks-cluster"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + tags_all             = (known after apply)
    }

  # module.eks.aws_eks_addon.addon_ebs_csi_driver will be created
+ resource "aws_eks_addon" "addon_ebs_csi_driver" {
      + addon_name           = "aws-ebs-csi-driver"
      + addon_version        = "v1.38.1-eksbuild.1"
      + arn                  = (known after apply)
      + cluster_name         = "devopslite-dev-eks-cluster"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + tags_all             = (known after apply)
    }

  # module.eks.aws_eks_addon.addon_kube_proxy will be created
+ resource "aws_eks_addon" "addon_kube_proxy" {
      + addon_name           = "kube-proxy"
      + addon_version        = "v1.31.3-eksbuild.2"
      + arn                  = (known after apply)
      + cluster_name         = "devopslite-dev-eks-cluster"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + tags_all             = (known after apply)
    }

  # module.eks.aws_eks_addon.addon_vpc_cni will be created
+ resource "aws_eks_addon" "addon_vpc_cni" {
      + addon_name           = "vpc-cni"
      + addon_version        = "v1.19.2-eksbuild.1"
      + arn                  = (known after apply)
      + cluster_name         = "devopslite-dev-eks-cluster"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + tags_all             = (known after apply)
    }

  # module.eks.aws_eks_cluster.eks_cluster will be created
+ resource "aws_eks_cluster" "eks_cluster" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = true
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + enabled_cluster_log_types     = [
          + "api",
          + "audit",
          + "authenticator",
          + "controllerManager",
          + "scheduler",
        ]
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "devopslite-dev-eks-cluster"
      + platform_version              = (known after apply)
      + role_arn                      = (known after apply)
      + status                        = (known after apply)
      + tags                          = {
          + "Environment" = "dev"
          + "Name"        = "devopslite-dev-eks-cluster"
          + "Project"     = "devopslite"
          + "Provisioner" = "terraform"
        }
      + tags_all                      = {
          + "Environment" = "dev"
          + "Name"        = "devopslite-dev-eks-cluster"
          + "Project"     = "devopslite"
          + "Provisioner" = "terraform"
        }
      + version                       = "1.31"

      + access_config {
          + authentication_mode = "API_AND_CONFIG_MAP"
        }

      + encryption_config {
          + resources = [
              + "secrets",
            ]

          + provider {
              + key_arn = (known after apply)
            }
        }

      + kubernetes_network_config (known after apply)

      + timeouts {
          + delete = "30m"
        }

      + upgrade_policy (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = false
          + public_access_cidrs       = (known after apply)
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_eks_node_group.eks_node_group will be created
+ resource "aws_eks_node_group" "eks_node_group" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = "ON_DEMAND"
      + cluster_name           = "devopslite-dev-eks-cluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = (known after apply)
      + node_group_name        = "devopslite-dev-ng"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags_all               = (known after apply)
      + version                = (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + node_repair_config (known after apply)

      + scaling_config {
          + desired_size = 6
          + max_size     = 10
          + min_size     = 6
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # module.eks.aws_iam_openid_connect_provider.eks_cluster_sa_oidc_provider will be created
+ resource "aws_iam_openid_connect_provider" "eks_cluster_sa_oidc_provider" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags_all        = (known after apply)
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # module.eks.aws_iam_policy.ebs_csi_driver_policy will be created
+ resource "aws_iam_policy" "ebs_csi_driver_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "IAM policy for EBS CSI driver"
      + id               = (known after apply)
      + name             = "devopslite_dev_ebs_csi_driver_policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:AttachVolume",
                          + "ec2:CreateSnapshot",
                          + "ec2:CreateTags",
                          + "ec2:CreateVolume",
                          + "ec2:DeleteSnapshot",
                          + "ec2:DeleteTags",
                          + "ec2:DeleteVolume",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeSnapshots",
                          + "ec2:DescribeTags",
                          + "ec2:DescribeVolumes",
                          + "ec2:DetachVolume",
                          + "ec2:ModifyVolume",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.eks.aws_iam_policy.eks_cluster_serviceaccount_vpc_cni_policy will be created
+ resource "aws_iam_policy" "eks_cluster_serviceaccount_vpc_cni_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "devopslite_dev_EKSClusterServiceAccountVPCCniPolicy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.eks.aws_iam_role.ebs_csi_driver_role will be created
+ resource "aws_iam_role" "ebs_csi_driver_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + description           = "IAM role for EBS CSI driver"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "devopslite_dev_ebs_csi_driver_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.eks.aws_iam_role.eks_cluster_role will be created
+ resource "aws_iam_role" "eks_cluster_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "sts:AssumeRole",
                          + "sts:TagSession",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description 
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.